# Программка
# name = input('Введите Ваше имя: ')
# current_yesr = 2024
# date_of_dirth = int(input('В каком году вы родились? ')) # Преобразование типа данных
# age = current_yesr - date_of_dirth
# # age = current_yesr - int(date_of_dirth) Тоже верное преобразование типа данных
# print('Здравствуйте:', name)
# print('В этом году Вам:', age, 'лет/года')

# Регистры
print('строка в верхнем регистре' .upper()) # Перевод в верхний регистр
print('СТРОКА В НИЖНЕМ РЕГИСТРЕ' .lower()) # Перевод в нижний регистр
print('строка'.replace('строка', 'не строка')) # Метод замены символов
print('просто так просто'.replace(' ', '1')) # Метод замены символов